/**
 * 枚举码与可读文本间转译器
 *
 * 格式：语言代码.表名.字段名.枚举码值 = 文本值
 * 各索引项按字母顺序排列
 */
import Vue from 'vue'

const enum_refer = {
  zh_cn: {
    apply: {
      stage: {
        '0': '待查看',
        '10': 'HR审核通过',
        '20': '部门审核通过',
        '30': '面试通过',
        '40': '协商待遇',
        '50': '待入职',
        '60': '待转正',
        '70': '已转正'
      },
      status: {
        'active': '进行中',
        'close': '企业取消',
        'halt': '用户取消',
        'done': '已完成'
      }
    },

    edu: {
      degree: {
        '0': '小学',
        '10': '初中',
        '20': '职高/中专/技校',
        '30': '高中',
        '40': '专科/副学士',
        '50': '本科/学士',
        '60': '硕士/双学士',
        '70': '副博士',
        '80': '博士'
      },
      status: {
        '0': '在读',
        '5': '肄业',
        '10': '毕业'
      }
    },

    post: {
      type: {
        '0': '远程/自由职业',
        '10': '兼职',
        '20': '实习',
        '30': '全职'
      }
    },

    stuff_biz: {
      status: {
        '0': '已离职',
        '30': '待审核',
        '50': '待入职',
        '100': '在职'
      }
    }
  }
}

// 注册为Vue实例中方法
Vue.prototype.My_enums = enum_refer
